; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	image2 - mode
	infrared1 - mode
	GroundStation2 - direction
	GroundStation1 - direction
	Star0 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 137)
	(= (data Phenomenon3 infrared0) 262)
	(= (data Phenomenon4 infrared0) 243)
	(= (data Planet5 infrared0) 172)
	(= (data Planet6 infrared0) 244)
	(= (data Phenomenon3 image2) 55)
	(= (data Phenomenon4 image2) 40)
	(= (data Planet5 image2) 28)
	(= (data Planet6 image2) 36)
	(= (data Phenomenon3 infrared1) 184)
	(= (data Phenomenon4 infrared1) 200)
	(= (data Planet5 infrared1) 294)
	(= (data Planet6 infrared1) 134)
	(= (slew_time GroundStation2 Star0) 48.76)
	(= (slew_time Star0 GroundStation2) 48.76)
	(= (slew_time GroundStation2 GroundStation1) 31.16)
	(= (slew_time GroundStation1 GroundStation2) 31.16)
	(= (slew_time GroundStation1 Star0) 44.75)
	(= (slew_time Star0 GroundStation1) 44.75)
	(= (slew_time Phenomenon3 Star0) 36.87)
	(= (slew_time Star0 Phenomenon3) 36.87)
	(= (slew_time Phenomenon3 GroundStation1) 43.17)
	(= (slew_time GroundStation1 Phenomenon3) 43.17)
	(= (slew_time Phenomenon3 GroundStation2) 4.854)
	(= (slew_time GroundStation2 Phenomenon3) 4.854)
	(= (slew_time Phenomenon4 Star0) 21.48)
	(= (slew_time Star0 Phenomenon4) 21.48)
	(= (slew_time Phenomenon4 GroundStation1) 44.22)
	(= (slew_time GroundStation1 Phenomenon4) 44.22)
	(= (slew_time Phenomenon4 GroundStation2) 68.71)
	(= (slew_time GroundStation2 Phenomenon4) 68.71)
	(= (slew_time Phenomenon4 Phenomenon3) 1.266)
	(= (slew_time Phenomenon3 Phenomenon4) 1.266)
	(= (slew_time Planet5 Star0) 16.74)
	(= (slew_time Star0 Planet5) 16.74)
	(= (slew_time Planet5 GroundStation1) 2.46)
	(= (slew_time GroundStation1 Planet5) 2.46)
	(= (slew_time Planet5 GroundStation2) 1.442)
	(= (slew_time GroundStation2 Planet5) 1.442)
	(= (slew_time Planet5 Phenomenon3) 40.83)
	(= (slew_time Phenomenon3 Planet5) 40.83)
	(= (slew_time Planet5 Phenomenon4) 2.495)
	(= (slew_time Phenomenon4 Planet5) 2.495)
	(= (slew_time Planet6 Star0) 28.67)
	(= (slew_time Star0 Planet6) 28.67)
	(= (slew_time Planet6 GroundStation1) 50.81)
	(= (slew_time GroundStation1 Planet6) 50.81)
	(= (slew_time Planet6 GroundStation2) 55.2)
	(= (slew_time GroundStation2 Planet6) 55.2)
	(= (slew_time Planet6 Phenomenon3) 42.77)
	(= (slew_time Phenomenon3 Planet6) 42.77)
	(= (slew_time Planet6 Phenomenon4) 11.32)
	(= (slew_time Phenomenon4 Planet6) 11.32)
	(= (slew_time Planet6 Planet5) 31.36)
	(= (slew_time Planet5 Planet6) 31.36)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon3 infrared1)
	(have_image Phenomenon4 infrared1)
	(have_image Planet6 image2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 137 to 134.54, (fuel-used) from 0 to 2.46
   goals met: 0 of 3
2. (turn_to satellite0 phenomenon4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 134.54 to 132.045, (fuel-used) from 2.46 to 4.955
   goals met: 0 of 3
3. (turn_to satellite0 phenomenon3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 132.045 to 130.779, (fuel-used) from 4.955 to 6.221
   goals met: 0 of 3
4. (turn_to satellite0 phenomenon4 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 130.779 to 129.513, (fuel-used) from 6.221 to 7.487
   goals met: 0 of 3
5. (turn_to satellite0 phenomenon3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 129.513 to 128.247, (fuel-used) from 7.487 to 8.753
   goals met: 0 of 3
6. (turn_to satellite0 planet5 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 128.247 to 87.417, (fuel-used) from 8.753 to 49.583
   goals met: 0 of 3
7. (turn_to satellite0 phenomenon4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 87.417 to 84.922, (fuel-used) from 49.583 to 52.078
   goals met: 0 of 3
8. (turn_to satellite0 phenomenon3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 84.922 to 83.656, (fuel-used) from 52.078 to 53.344
   goals met: 0 of 3
9. (turn_to satellite0 phenomenon4 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 83.656 to 82.39, (fuel-used) from 53.344 to 54.61
   goals met: 0 of 3
10. (turn_to satellite0 phenomenon3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 82.39 to 81.124, (fuel-used) from 54.61 to 55.876
   goals met: 0 of 3
11. (turn_to satellite0 phenomenon4 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 81.124 to 79.858, (fuel-used) from 55.876 to 57.142
   goals met: 0 of 3
12. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 3
13. (turn_to satellite0 planet6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 79.858 to 68.538, (fuel-used) from 57.142 to 68.462
   goals met: 0 of 3
14. (turn_to satellite0 star0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 68.538 to 39.868, (fuel-used) from 68.462 to 97.132
   goals met: 0 of 3
15. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 3
16. (turn_to satellite0 phenomenon4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 39.868 to 18.388, (fuel-used) from 97.132 to 118.612
   goals met: 0 of 3
17. (turn_to satellite0 phenomenon3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 18.388 to 17.122, (fuel-used) from 118.612 to 119.878
   goals met: 0 of 3
18. (take_image satellite0 phenomenon3 instrument2 infrared1)
   added: (have_image phenomenon3 infrared1)
   changed: (data_capacity satellite0) from 1000 to 816, (data-stored) from 0 to 184
   goals met: 1 of 3
19. (turn_to satellite0 phenomenon4 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 17.122 to 15.856, (fuel-used) from 119.878 to 121.144
   goals met: 1 of 3
20. (take_image satellite0 phenomenon4 instrument2 infrared1)
   added: (have_image phenomenon4 infrared1)
   changed: (data_capacity satellite0) from 816 to 616, (data-stored) from 184 to 384
   goals met: 2 of 3
21. (turn_to satellite0 planet6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 15.856 to 4.536, (fuel-used) from 121.144 to 132.464
   goals met: 2 of 3
22. (take_image satellite0 planet6 instrument2 image2)
   added: (have_image planet6 image2)
   changed: (data_capacity satellite0) from 616 to 580, (data-stored) from 384 to 420
   goals met: 3 of 3
